tap "adoptopenjdk/openjdk"
tap "drone/drone"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mshell/mshell", "git@github.skyscannertools.net:mshell/homebrew-mshell.git"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Freely available high-quality data compressor
brew "bzip2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-file caching compiler wrapper
brew "ccache"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Generic library support script
brew "libtool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# SMART hard drive monitoring
brew "smartmontools"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "drone/drone/drone"
# Skyscanner Artifactory login command.
brew "mshell/mshell/artifactory-cli-login"
# Enhanced project cookiecut tooling by MShell
brew "mshell/mshell/mshell-cut"
# MShell helper scripts
brew "mshell/mshell/mshell-tools"
# Protovend protobuf management tool by MShell
brew "mshell/mshell/protovend"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Two-factor authentication software
cask "authy"
cask "colour-contrast-analyser"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java8"
# Keyboard customizer
cask "karabiner-elements"
# Collaboration platform for API development
cask "postman"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Development ide
cask "visual-studio-code"
