tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "skyscanner/tools"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line automation tool
brew "bitrise"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# YAML Parser
brew "libyaml"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3", link: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# SMART hard drive monitoring
brew "smartmontools"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Watch files and take action when they change
brew "watchman"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Skyscanner Artifactory login command.
brew "mshell/mshell/artifactory-cli-login"
# MShell helper scripts
brew "mshell/mshell/mshell-tools"
# Recommended tools for Skyscanner Software Engineers
brew "mshell/mshell/skyscanner-bundle"
# Simple tool to help apply changes across many GitHub repositories simultaneously
brew "skyscanner/tools/turbolift"
# Command-line interface for 1Password
cask "1password-cli"
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
cask "colour-contrast-analyser"
# Application uninstaller
cask "appcleaner"
# Free and open-source web browser
cask "chromium"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organised
cask "notion"
# Keyboard customizer
cask "karabiner-elements"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
vscode "adpyke.codesnap"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "christian-kohler.npm-intellisense"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "parallelsdesktop.parallels-desktop"
vscode "philsinatra.nested-comments"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "stylelint.vscode-stylelint"
vscode "supernovaio.pulsar-vsc-extension"
vscode "syler.sass-indented"
vscode "usernamehw.errorlens"
vscode "wmaurer.change-case"
